#include<stdio.h>


//int main() {//整形和浮点型在内存中不一样
//	int n = 9;
//	/*int* n1 = (int*) & n;
//	printf("%d\n",n);
//	printf("%d\n",*n1);*/
//	float* p = (float*) & n;
//	printf("%d\n",n);
//	printf("%f\n",*p);
//
//	*p = 9.0;
//	printf("%d\n", n);
//	printf("%f\n", *p);
//	return 0;
//}

//int main() {
//	float b = 2.5;
//	//101.1
//	//(-1)^0 * 1.011 * 2^2
//	//S=0
//	//M=1.011
//	//E=2
//	//0 127+2    011(小数点前的1省略掉)
//	//0 10000001 01100000000000000000000
//	//0x40b00000
//	return 0;
//}


//#include<math.h>
//int main() {
//	double d = 1e3;
//	double d1 = pow(2,3);
//	printf("%lf\n",d);
//	printf("%lf",d1);
//	return 0;
//}





//int main() {//unsigned char范围：-128~127  char和signed的范围：0~255
//	char a = -128;
////	00000000000000000000000010000000
////	11111111111111111111111101111111
////	11111111111111111111111110000000--补码
////	10000000
//
////	11111111111111111111111110000000--补码
//	printf("%u\n",a);
//	//u打印无符号
//	//d打印有符号
//	return 0;
//}



//int main() {//unsigned
//	char a = -1;
// 11111111111111111111111111111111 ---1
//	signed char b = -1;
// 11111111111111111111111111111111 ---1
//	unsigned char c = -1;
// 00000000000000000000000011111111 --255
//	printf("a=%d,b=%d,c=%d\n",a,b,c);
//	return 0;
//}




//check_sys() {
//	int a = 1;//检查当前机器的字节序是大端还是小端
//	char* p = (char*)&a;
//	return *p;
//}
//int main() {
//	/*int a = 1;//检查当前机器的字节序是大端还是小端
//	char* p = (char*)&a;
//	if (*p==1) {
//		printf("小端");
//	}
//	else printf("大端");
//	*/
//
//	int ret= check_sys();
//	if (ret == 1)printf("小端");
//	else printf("大端");
//	return 0;
//}



//int main() {
//	int a = 0x11223344;
//	return 0;
//}



//int main() {//数据在计算机中是用补码进行相加
//	1 - 1;
//	//1+(-1)
//	//00000000000000000000000000000001
//	//11111111111111111111111111111111--补码相加
//	//00000000000000000000000000000000
//	return 0;
//}




//int main() {//内存中存储的是用2进制，显示是16进制
//	int a = 20;
//	//00000000000000000000000000010100--原码
//	//00000000000000000000000000010100--反码
//	//00000000000000000000000000010100--补码
//	//0x00000014  --16进制，将二进制每四个分开，得到16进制
//	int b = -10;
//	//10000000000000000000000000001010--原码
//	//11111111111111111111111111110101--反码
//	//11111111111111111111111111110110--补码
//	//0xfffffff6  --16进制，内存中存的是补码
//	return 0;
//}